Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
aws_iam_role_policy_attachment" "AmazonElasticFileSystemClientFullAccess-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonElasticFileSystemClientFullAccess"
      + role       = (known after apply)
    }

  # module.lambda-file-systems.aws_lambda_function.example_lambda will be created
+ resource "aws_lambda_function" "example_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "hello_lambda.zip"
      + function_name                  = "hello_lambda"
      + handler                        = "hello_lambda.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "eUlmHhO6Fix0OZDyg08kPxIQkrvsF4STLRQ2Zv3M6Es="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "greeting" = "Hello"
            }
        }

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # module.sagemaker.data.aws_iam_policy_document.foo will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "foo" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sagemaker:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sagemaker.aws_iam_policy.foo will be created
+ resource "aws_iam_policy" "foo" {
      + arn         = (known after apply)
      + description = "Allow SageMaker to create model"
      + id          = (known after apply)
      + name        = "terraform-sagemaker-example"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.sagemaker.aws_iam_role.foo will be created
+ resource "aws_iam_role" "foo" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sagemaker.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-sagemaker-example"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sagemaker.aws_iam_role_policy_attachment.foo will be created
+ resource "aws_iam_role_policy_attachment" "foo" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform-sagemaker-example"
    }

  # module.sagemaker.aws_s3_bucket.foo will be created
+ resource "aws_s3_bucket" "foo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sagemaker.aws_s3_bucket_acl.foo_bucket_acl will be created
+ resource "aws_s3_bucket_acl" "foo_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.sagemaker.aws_s3_object.object will be created
+ resource "aws_s3_object" "object" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "model.tar.gz"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "model.tar.gz"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sagemaker.aws_sagemaker_endpoint.foo will be created
+ resource "aws_sagemaker_endpoint" "foo" {
      + arn                  = (known after apply)
      + endpoint_config_name = "terraform-sagemaker-example"
      + id                   = (known after apply)
      + name                 = "terraform-sagemaker-example"
      + tags                 = {
          + "foo" = "bar"
        }
      + tags_all             = {
          + "foo" = "bar"
        }
    }

  # module.sagemaker.aws_sagemaker_endpoint_configuration.foo will be created
+ resource "aws_sagemaker_endpoint_configuration" "foo" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "terraform-sagemaker-example"
      + name_prefix = (known after apply)
      + tags        = {
          + "foo" = "bar"
        }
      + tags_all    = {
          + "foo" = "bar"
        }

      + production_variants {
          + initial_instance_count = 1
          + initial_variant_weight = 1
          + instance_type          = "ml.t2.medium"
          + model_name             = "terraform-sagemaker-example"
          + variant_name           = "variant-1"
          + volume_size_in_gb      = (known after apply)
        }
    }

  # module.sagemaker.aws_sagemaker_model.foo will be created
+ resource "aws_sagemaker_model" "foo" {
      + arn                = (known after apply)
      + execution_role_arn = (known after apply)
      + id                 = (known after apply)
      + name               = "terraform-sagemaker-example"
      + tags               = {
          + "foo" = "bar"
        }
      + tags_all           = {
          + "foo" = "bar"
        }

      + primary_container {
          + image          = "425443422359.dkr.ecr.us-west-2.amazonaws.com/foo:latest"
          + mode           = "SingleModel"
          + model_data_url = (known after apply)
        }
    }

  # module.sagemaker.random_integer.bucket_suffix will be created
+ resource "random_integer" "bucket_suffix" {
      + id     = (known after apply)
      + max    = 99999
      + min    = 1
      + result = (known after apply)
    }

Plan: 74 to add, 0 to change, 0 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on eks/providers.tf line 18:
│   18: provider "http" {}
│ 
│ Earlier versions of Terraform used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "http" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.eks:
│     http = {
│       source = "hashicorp/http"
│     }
│ 
│ (and one more similar warning elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://47c2609e1e37:4141/lock?id=inkdrop-org%252Finkdrop-atlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 74 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`